In [22]:
from pyspark.sql import SparkSession

In [23]:
spark = SparkSession.builder.appName('Handling Values').getOrCreate()

In [24]:
df_spark = spark.read.csv(r"E:\CSV File\Handling_values.csv",header = True,inferSchema = True)

In [25]:
df_spark.show()

+-------+----+----------+------+
|  Name | Age|Experience|Salary|
+-------+----+----------+------+
| mahesh|  22|         2| 30000|
|  gnana|  22|         0| 20000|
| girish|  34|         2| 45000|
|darshan|  25|         2| 40000|
|   jhon|  24|      NULL| 27000|
|    raj|NULL|         1| 25000|
|   NULL|  20|         1|  9000|
|   NULL|  30|         3|100000|
|    joy|NULL|      NULL|  NULL|
+-------+----+----------+------+

In [26]:
df_spark.na.drop().show()

+-------+---+----------+------+
|  Name |Age|Experience|Salary|
+-------+---+----------+------+
| mahesh| 22|         2| 30000|
|  gnana| 22|         0| 20000|
| girish| 34|         2| 45000|
|darshan| 25|         2| 40000|
+-------+---+----------+------+

In [27]:
df_spark.na.drop(how = 'all').show()

+-------+----+----------+------+
|  Name | Age|Experience|Salary|
+-------+----+----------+------+
| mahesh|  22|         2| 30000|
|  gnana|  22|         0| 20000|
| girish|  34|         2| 45000|
|darshan|  25|         2| 40000|
|   jhon|  24|      NULL| 27000|
|    raj|NULL|         1| 25000|
|   NULL|  20|         1|  9000|
|   NULL|  30|         3|100000|
|    joy|NULL|      NULL|  NULL|
+-------+----+----------+------+

In [28]:
df_spark.na.drop(how = 'any').show()

+-------+---+----------+------+
|  Name |Age|Experience|Salary|
+-------+---+----------+------+
| mahesh| 22|         2| 30000|
|  gnana| 22|         0| 20000|
| girish| 34|         2| 45000|
|darshan| 25|         2| 40000|
+-------+---+----------+------+

In [32]:
df_spark.na.drop(how = 'all',thresh = 3).show()

+-------+----+----------+------+
|  Name | Age|Experience|Salary|
+-------+----+----------+------+
| mahesh|  22|         2| 30000|
|  gnana|  22|         0| 20000|
| girish|  34|         2| 45000|
|darshan|  25|         2| 40000|
|   jhon|  24|      NULL| 27000|
|    raj|NULL|         1| 25000|
|   NULL|  20|         1|  9000|
|   NULL|  30|         3|100000|
+-------+----+----------+------+

In [39]:
df_spark.na.drop(how = 'any',thresh = 3).show()

+-------+----+----------+------+
|  Name | Age|Experience|Salary|
+-------+----+----------+------+
| mahesh|  22|         2| 30000|
|  gnana|  22|         0| 20000|
| girish|  34|         2| 45000|
|darshan|  25|         2| 40000|
|   jhon|  24|      NULL| 27000|
|    raj|NULL|         1| 25000|
|   NULL|  20|         1|  9000|
|   NULL|  30|         3|100000|
+-------+----+----------+------+

In [40]:
#subset
df_spark.na.drop(how ='any',subset =['Age']).show()

+-------+---+----------+------+
|  Name |Age|Experience|Salary|
+-------+---+----------+------+
| mahesh| 22|         2| 30000|
|  gnana| 22|         0| 20000|
| girish| 34|         2| 45000|
|darshan| 25|         2| 40000|
|   jhon| 24|      NULL| 27000|
|   NULL| 20|         1|  9000|
|   NULL| 30|         3|100000|
+-------+---+----------+------+

Filling missing values

In [41]:
from pyspark.ml.feature import Imputer

In [55]:
imputer = Imputer(
    inputCols=["Age", "Experience", "Salary"],  # Only numeric columns
    outputCols=["Age_imputed", "Experience_imputed", "Salary_imputed"]
).setStrategy("mean")

In [56]:
df_imputed = imputer.fit(df_spark).transform(df_spark)

In [57]:
df_imputed.show()

+-------+----+----------+------+-----------+------------------+--------------+
|  Name | Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
| mahesh|  22|         2| 30000|         22|                 2|         30000|
|  gnana|  22|         0| 20000|         22|                 0|         20000|
| girish|  34|         2| 45000|         34|                 2|         45000|
|darshan|  25|         2| 40000|         25|                 2|         40000|
|   jhon|  24|      NULL| 27000|         24|                 1|         27000|
|    raj|NULL|         1| 25000|         25|                 1|         25000|
|   NULL|  20|         1|  9000|         20|                 1|          9000|
|   NULL|  30|         3|100000|         30|                 3|        100000|
|    joy|NULL|      NULL|  NULL|         25|                 1|         37000|
+-------+----+----------+------+-----------+------------------+--------------+